Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоступилПолностью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзАкцес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПроизводители</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийДатыПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовНаПоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПрямаяПоставкаНаМагазины</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Предзаказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Предзаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыЗаказовНаПоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовНаПоставку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаемДляРаспределения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПридётДоРазвоза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтПоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказПоставщику/Forms/ФормаПодбора/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаб Из ТаблицаДокументы Цикл
		СтрокаТаб.Выбран = Истина;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТаб Из ТаблицаДокументы Цикл
		СтрокаТаб.Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	МассивДокументов = Новый Массив();
	Для Каждого СтрокаТаб Из ТаблицаДокументы Цикл
		Если СтрокаТаб.Выбран = Истина Тогда
			МассивДокументов.Добавить(СтрокаТаб.Документ);
		КонецЕсли;
	КонецЦикла;	
	
	Закрыть(МассивДокументов);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Подбор заказов по поставщику: " + Параметры.Поставщик;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПоставщику.Ссылка,
	               |	ЗаказПоставщику.Номер,
	               |	ЗаказПоставщику.ДатаПоступления КАК ДатаПоступления,
	               |	ДОБАВИТЬКДАТЕ(ЗаказПоставщику.ДатаПоступления, ДЕНЬ, -1) КАК ДатаПоступленияНаСклад,
	               |	ЗаказПоставщику.Склад,
	               |	ЗаказПоставщику.Поставщик,
	               |	ЗаказПоставщику.ЗаказПоступилПолностью,
	               |	ИСТИНА КАК Выбран,
	               |	ЗаказПоставщику.Автор
	               |ИЗ
	               |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	               |ГДЕ
	               |	ЗаказПоставщику.Проведен = ИСТИНА
	               |	И ЗаказПоставщику.Поставщик = &Поставщик
				   |	И ЗаказПоставщику.Организация = &Организация
	               |	И ЗаказПоставщику.ДатаПоступления = &Дата
	               |	И ЗаказПоставщику.Склад = &Владелец
	               |	И (НЕ ЗаказПоставщику.ЗаказПоступилПолностью
	               |				И &ТолькоАктуальные
	               |			ИЛИ НЕ &ТолькоАктуальные)
	               |	И ЗаказПоставщику.Статус <> &Статус
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаПоступления УБЫВ";
				   
	Запрос.УстановитьПараметр("Поставщик", Параметры.Поставщик);
	//+++АК KIRN 2018.03.30  ИП-00018240
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	//---АК KIRN 
	
	//Запрос.УстановитьПараметр("ДатаНач", ДобавитьМесяц(Параметры.Дата, -6));
	//Запрос.УстановитьПараметр("ДатаКон", ДобавитьМесяц(Параметры.Дата, 1));
	Запрос.УстановитьПараметр("Дата", Параметры.Дата);
	Запрос.УстановитьПараметр("Владелец", Параметры.Склад.Владелец);
	Запрос.УстановитьПараметр("ТолькоАктуальные", Параметры.ТолькоАктуальные);
	//Если Параметры.ОжидаемДляРаспределения=Истина Тогда
	//	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовНаПоставку.ОжидаемДляРаспределения);
	//	Запрос.УстановитьПараметр("БезФильтраПоСтатусам", Ложь);
	//Иначе
	//	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовНаПоставку.ПустаяСсылка());
	//	Запрос.УстановитьПараметр("БезФильтраПоСтатусам", Истина);
	//КонецЕсли;	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовНаПоставку.ОтказОтПоставки);
	Запрос.УстановитьПараметр("ДатаАктуальностиЗаказов", НачалоДня(Параметры.Дата-24*60*60*Константы.СрокАктуальностиЗаказовПоставщикам.Получить()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаб = ТаблицаДокументы.Добавить();
		СтрокаТаб.Выбран = Выборка.Выбран;
		СтрокаТаб.Номер = Выборка.Номер;
		СтрокаТаб.ДатаПоступления = Выборка.ДатаПоступления;
		СтрокаТаб.ДатаПоступленияНаСклад = Выборка.ДатаПоступленияНаСклад;
		СтрокаТаб.Склад = Выборка.Склад;
		СтрокаТаб.Поставщик = Выборка.Поставщик;
		СтрокаТаб.ЗаказПоступилПолностью = Выборка.ЗаказПоступилПолностью;
		СтрокаТаб.Документ = Выборка.Ссылка;
		СтрокаТаб.Автор=Выборка.Автор;
	КонецЦикла;	
	
КонецПроцедуры
